IDEA Open Model
Element2DType Enumeration
Compatible with IDEA StatiCa Beta 20.0
 Analysis Type of 2D IOM element
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public enum Element2DType
Public Enumeration Element2DType
Members
Member name | Value | Description
Shell | 0 |  Shell
Slab | 1 |  Slab
Wall | 2 |  Wall
See Also
Reference
IdeaRS.OpenModel.Model Namespace